I still think this is scenario which will cause issues for multiple users using this module. 


Scenario which you pasted here and in issue #1356 is very specific for you (and maybe few other users). 

Currently I am not using Fargate under EKS at all and running your branch producing me:
```
......
  # module.eks_cluster.module.fargate.aws_iam_role.eks_fargate_pod[0] will be created
  + resource "aws_iam_role" "eks_fargate_pod" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "eks-tools-fargate"
      + path                  = "/"
      + tags                  = {
          + "Name" = "eks-tools"
        }
      + tags_all              = {
          + "Name"    = "eks-tools"
          + "project" = "scp"
          + "source"  = "tf-scp-tools"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_cluster.module.fargate.aws_iam_role_policy_attachment.eks_fargate_pod[0] will be created
  + resource "aws_iam_role_policy_attachment" "eks_fargate_pod" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }
......
```

What generally violating AWS/EKS best practices to follow least privileges approach (in result not create a roles/policies which are not required).


I still dont understand why you trying to generate those roles inside module instead generate them outside (or create company specific module) as in case when you manage `aws-auth` configmap outside module there shouldnt be difference for you.